In [1]:
import pandas as pd
import glob
from datetime import datetime

In [2]:
def extract_from_json(file_to_process):
    dataframe = pd.read_json(file_to_process)
    return dataframe

In [3]:
jsonfile1 = pd.read_json('bank_market_cap_1.json')
jsonfile1.head(10)

                                      Name  Market Cap (US$ Billion)
0                           JPMorgan Chase                   390.934
1  Industrial and Commercial Bank of China                   345.214
2                          Bank of America                   325.331
3                              Wells Fargo                   308.013
4                  China Construction Bank                   257.399
5                        HSBC Holdings PLC                   219.270
6               Agricultural Bank of China                   203.244
7                           Citigroup Inc.                   203.165
8                            Bank of China                   181.469
9                     China Merchants Bank                   122.616

In [4]:
jsonfile1.shape

(70, 2)

In [5]:
jsonfile2 = pd.read_json('bank_market_cap_2.json')
jsonfile2.head(10)

                                Name  Market Cap (US$ Billion)
35   Banco Bilbao Vizcaya Argentaria                    60.678
36                   Japan Post Bank                    60.525
37       The Bank of New York Mellon                    59.823
38  Shanghai Pudong Development Bank                    58.796
39           Industrial Bank (China)                    57.388
40         Bank of China (Hong Kong)                    55.449
41                  Bank of Montreal                    53.181
42                   Crédit Agricole                    52.141
43                          DBS Bank                    51.475
44                            Nordea                    51.185

In [6]:
jsonfile2.shape

(35, 2)

In [7]:
jsonfile1['Name']

0                              JPMorgan Chase
1     Industrial and Commercial Bank of China
2                             Bank of America
3                                 Wells Fargo
4                     China Construction Bank
                       ...
65                               Ping An Bank
66                         Standard Chartered
67                       United Overseas Bank
68                                  QNB Group
69                                Bank Rakyat
Name: Name, Length: 70, dtype: object

In [8]:
columns = ["Name", "Market Cap (US$ Billion)"]

def extract():
    extracted_data = pd.DataFrame(columns = columns)
    for jsonfile in glob.glob("*.json"):
        extracted_data = extracted_data._append(extract_from_json(jsonfile), ignore_index = True)

    return extracted_data

In [9]:
my_extracted_df = extract()
my_extracted_df

C:\Users\CSuresh\AppData\Local\Temp\ipykernel_24512\2658133892.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  extracted_data = extracted_data._append(extract_from_json(jsonfile), ignore_index = True)

                                        Name  Market Cap (US$ Billion)
0                             JPMorgan Chase                   390.934
1    Industrial and Commercial Bank of China                   345.214
2                            Bank of America                   325.331
3                                Wells Fargo                   308.013
4                    China Construction Bank                   257.399
..                                       ...                       ...
100                             Ping An Bank                    37.993
101                       Standard Chartered                    37.319
102                     United Overseas Bank                    35.128
103                                QNB Group                    33.560
104                              Bank Rakyat                    33.081

[105 rows x 2 columns]

In [10]:
dataframe = pd.read_csv('exchange_rates.csv', index_col = 0)
dataframe.head(10)

         Rates
AUD   1.297088
BGN   1.608653
BRL   5.409196
CAD   1.271426
CHF   0.886083
CNY   6.483139
CZK  21.510117
DKK   6.119757
EUR   0.822504
GBP   0.732398

In [11]:
def read_csv(file_to_process):
    dataframe = pd.read_csv(file_to_process, index_col = 0)
    return dataframe

def extract_csv():
    for csvfiles in glob.glob("*.csv"):
        extracted_csv_data = pd.DataFrame(read_csv(csvfiles))
    return extracted_csv_data

In [12]:
my_csv_extracted = extract_csv()
my_csv_extracted.head(10)

         Rates
AUD   1.297088
BGN   1.608653
BRL   5.409196
CAD   1.271426
CHF   0.886083
CNY   6.483139
CZK  21.510117
DKK   6.119757
EUR   0.822504
GBP   0.732398

In [13]:
exchange_rate = float(my_csv_extracted.loc["GBP"])
exchange_rate

C:\Users\CSuresh\AppData\Local\Temp\ipykernel_24512\1698696865.py:1: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  exchange_rate = float(my_csv_extracted.loc["GBP"])

0.7323984208000001

In [14]:
def transform(data):
    data["Market Cap (US$ Billion)"] = round(data["Market Cap (US$ Billion)"] * exchange_rate, 3)
    data.rename(columns = {"Name": "Name", "Market Cap (US$ Billion)" : "Market Cap (GBP Billion)"}, inplace = True, errors = "raised")
    return data

In [15]:
my_transfor_df = transform(my_extracted_df)
my_transfor_df.head(5)

                                      Name  Market Cap (GBP Billion)
0                           JPMorgan Chase                   286.319
1  Industrial and Commercial Bank of China                   252.834
2                          Bank of America                   238.272
3                              Wells Fargo                   225.588
4                  China Construction Bank                   188.519

In [16]:
filename = "bank_market_cap_gbp.csv"

def load(filename, data):
    data.to_csv(filename, index = False)

In [17]:
logfilename = "bmc_log.txt"

def log(message):
    timestamp = datetime.now().strftime("Date: %h %d, %Y - Time: %H:%M:%S")
    with open(logfilename, "a") as txtfile:
        txtfile.write(f"{timestamp} : {message}. \n")

In [18]:
log("ETL Job Started")
log("Extract Phase started")

In [19]:
extractedData = extract()
extractedData.head()

C:\Users\CSuresh\AppData\Local\Temp\ipykernel_24512\2658133892.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  extracted_data = extracted_data._append(extract_from_json(jsonfile), ignore_index = True)

                                      Name  Market Cap (US$ Billion)
0                           JPMorgan Chase                   390.934
1  Industrial and Commercial Bank of China                   345.214
2                          Bank of America                   325.331
3                              Wells Fargo                   308.013
4                  China Construction Bank                   257.399

In [20]:
log("Extract Phase Ended")
log("Transform Phase started")

In [21]:
transformedData = transform(extractedData)
transformedData.head()

                                      Name  Market Cap (GBP Billion)
0                           JPMorgan Chase                   286.319
1  Industrial and Commercial Bank of China                   252.834
2                          Bank of America                   238.272
3                              Wells Fargo                   225.588
4                  China Construction Bank                   188.519

In [22]:
log("Transform Phase Ended")
log("Load Phase started")

In [23]:
load(filename, transformedData)

In [24]:
log("Load Phase Ended")